### Pandas

Pandas is a Python library used for working with datasets. It does that by helping us make sense of DataFrames, which are a form of two-dimensional structured data, like a table with columns and rows. But before we can do anything else, we need to start with data in a CSV file.

### Importing Data (CSV Files)

CSV stands for Comma Separated Values, and it's a file type that allows data to be saved in a table. Data presented in a table is called structured data, because it adheres to the idea that there is a meaningful relationship between the columns and rows. A CSV might also show panel data, which is data that shows observations of the same behavior at various different times. The datasets we're using in this part of the course are all structured tables, but you'll see other arrangements of data as you move through your projects.

### Dictionaries

You can create a DataFrame from a Python dictionary using from_dict function.

In [1]:
import pandas as pd

data = {"col_1": [3, 2, 1, 0], "col_2": ["a", "b", "c", "d"]}
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

By default, DataFrame will be created using keys as columns. Note the length of the values should be equal for each key for the code to work. We can also let keys to be index instead of the columns:

In [2]:
pd.DataFrame.from_dict(data, orient="index")

       0  1  2  3
col_1  3  2  1  0
col_2  a  b  c  d

In [3]:
pd.DataFrame.from_dict(data, orient="index", columns=["A", "B", "C", "D"])

       A  B  C  D
col_1  3  2  1  0
col_2  a  b  c  d

### JSON Files

JSON is short for JavaScript Object Notation. It is another widely used data format to store and transfer the data. It is light-weight and very human readable. In Python, we can use the json library to read JSON files. Here is an example of a JSON string.

In [4]:
info = """{
    "firstName": "Jane",
    "lastName": "Doe",
    "hobby": "running",
    "age": 35
}"""
print(info)

{
    "firstName": "Jane",
    "lastName": "Doe",
    "hobby": "running",
    "age": 35
}

Use json library to load the json string into a Python dictionary:

In [5]:
import json

data = json.loads(info)
data

{'firstName': 'Jane', 'lastName': 'Doe', 'hobby': 'running', 'age': 35}

In [6]:
data["firstName"]

'Jane'

A dictionary may not be as convenient as a DataFrame in terms of data manipulation and cleaning. But once we've turned our json string into a dictionary, we can transform it into a DataFrame using the from_dict method.

In [7]:
df = pd.DataFrame.from_dict(data, orient="index", columns=["subject 1"])
df

          subject 1
firstName      Jane
lastName        Doe
hobby       running
age              35

### Load Compressed file in Python

In the big data era, it is very likely that we'll need to read data from compressed files. One way to unzip the data is to use gzip. We can load the poland-bankruptcy-data-2008.json.gz file from the data folder using the following code:

In [ ]:
import gzip
import json

with gzip.open("data/poland-bankruptcy-data-2010.json.gz", "r") as f:
    poland_data_gz = json.load(f)

In [ ]:
poland_data_gz.keys()

In [ ]:
df = pd.DataFrame().from_dict(poland_data_gz["data"])

In [ ]:
df.head()

### Pickle Files

Pickle in Python is primarily used in serializing and deserializing a Python object structure. Serialization is the process of turning an object in memory into a stream of bytes so you can store it on disk or send it over a network. Deserialization is the reverse process: turning a stream of bytes back into an object in memory.

According to the pickle module documentation, the following types can be pickled:
- None
- Booleans
- Integers, long integers, floating point numbers, complex numbers
- Normal and Unicode strings
- Tuples, lists, sets, and dictionaries containing only objects that can be pickled
- Functions defined at the top level of a module
- Built-in functions defined at the top level of a module
- Classes that are defined at the top level of a module

Let's demonstrate using a python dictionary as an example.

In [8]:
clothes = {"shirt": ["red", "M"], "sweater": ["yellow", "L"], "jacket": ["black", "L"]}
clothes

{'shirt': ['red', 'M'], 'sweater': ['yellow', 'L'], 'jacket': ['black', 'L']}

In [9]:
import pickle

pickle.dump(clothes, open("./data/clothes.pkl", "wb"))

In [10]:
with open("./data/clothes.pkl", "rb") as f:
    unpickled = pickle.load(f)

In [11]:
unpickled

{'shirt': ['red', 'M'], 'sweater': ['yellow', 'L'], 'jacket': ['black', 'L']}

### Working with DataFrames

The first thing we need to do is import pandas; we'll use pd as an alias when we include it in our code.

Pandas is just a library; to get anything done, we need a dataset too. We'll use the read_csv method to create a DataFrame from a CSV file.

In [13]:
import pandas as pd

df = pd.read_csv("data/mexico-city-real-estate-1.csv")
df.head()

  property_type department    lat     lon  area_m2  price_usd
0         house          A  4.690 -74.048    187.0  330899.98
1         house          C  4.695 -74.082     82.0  121555.09
2         house          A  4.535 -75.676    235.0  219474.47
3         house          C  4.620 -74.129    195.0   97919.38

### Working with DataFrame Indices

A DataFrame stores data in a row-and-column format. The DataFrame Index is a special kind of column that helps identify the location of each row. The default Index uses integers starting at zero, but you can also set up customized indices like "name", "location", etc. For example, in the following real estate data set, the default index are the integer counts.

In [14]:
df.index[:5]

RangeIndex(start=0, stop=4, step=1)

In [15]:
df.set_index("department", inplace=True)
df.head()

           property_type    lat     lon  area_m2  price_usd
department
A                  house  4.690 -74.048    187.0  330899.98
C                  house  4.695 -74.082     82.0  121555.09
A                  house  4.535 -75.676    235.0  219474.47
C                  house  4.620 -74.129    195.0   97919.38

In [16]:
data = {
    "letter": ["a", "b", "c", "d"],
    "number": [3, 2, 1, 0],
    "location": ["east", "east", "east", "west"],
}
df = pd.DataFrame.from_dict(data)

# set index 'numbers'
df.set_index("number", inplace = True)
df

       letter location
number
3           a     east
2           b     east
1           c     east
0           d     west

In [17]:
# reset index
df.reset_index(inplace = True)
df

   number letter location
0       3      a     east
1       2      b     east
2       1      c     east
3       0      d     west

### Inspecting DataFrames

Once we've created a DataFrame, we need to inspect it in order to see what's there. Pandas has many ways to inspect a DataFrame, but we're only going to look at three of them: shape, info, and head.

If we're interested in understanding the dimensionality of the DataFrame, we can use the df.shape method. The code looks like this:

In [18]:
df.shape

(4, 3)

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  5 non-null      object
 1   department     5 non-null      object
 2   lat-lon        5 non-null      object
 3   area_m2        4 non-null      float64
 4   price_usd      5 non-null      float64
 5                  0 non-null      float64
dtypes: float64(3), object(3)
memory usage: 368.0+ bytes

The info output tells us all sorts of things about the DataFrame: the number of columns, the names of the columns, the data type for each column, how many non-null rows are contained in the DataFrame.

### Sorting

Even though the DataFrame in many ways behaves similarly to a dict, it also is ordered. Therefore we can sort the data in it. Pandas provides two sorting methods, sort_values and sort_index.

In [48]:
import pandas as pd

df = pd.read_csv("data/mexico-city-real-estate-1.csv")
df.head()

  property_type department        lat-lon  area_m2  price_usd
0         house          A   4.69,-74.048    187.0  330899.98
1         house          C  4.695,-74.082     82.0  121555.09
2         house          A  4.535,-75.676    235.0  219474.47
3         house          C   4.62,-74.129    195.0   97919.38
4         house          C    4.62,123.23      NaN   97919.38

In [49]:
df.sort_values("area_m2").head()

  property_type department        lat-lon  area_m2  price_usd
1         house          C  4.695,-74.082     82.0  121555.09
0         house          A   4.69,-74.048    187.0  330899.98
3         house          C   4.62,-74.129    195.0   97919.38
2         house          A  4.535,-75.676    235.0  219474.47
4         house          C    4.62,123.23      NaN   97919.38

In [51]:
df.set_index("price_usd").sort_index().head()

          property_type department        lat-lon  area_m2
price_usd
97919.38          house          C   4.62,-74.129    195.0
97919.38          house          C    4.62,123.23      NaN
121555.09         house          C  4.695,-74.082     82.0
219474.47         house          A  4.535,-75.676    235.0
330899.98         house          A   4.69,-74.048    187.0

### Working with Columns

Sometimes, it’s handy to duplicate a column of data. It might be that you’d like to drop some data points or erase empty cells while still preserving the original column. If you’d like to do that, you’ll need to duplicate the column. We can do this by placing the name of the new column in square brackets.

### Adding Columns

For example, we might want to add a column of data that shows the price per square meter of each house in US dollars. To do that, we're going to need to create a new column, and include the necessary math to populate it. First, we need to import the CSV and inspect the first five rows using the head method, like this:

In [52]:
df["price_m2"] = df["price_usd"] / df["area_m2"]
df.head()

  property_type department        lat-lon  area_m2  price_usd     price_m2
0         house          A   4.69,-74.048    187.0  330899.98  1769.518610
1         house          C  4.695,-74.082     82.0  121555.09  1482.379146
2         house          A  4.535,-75.676    235.0  219474.47   933.933915
3         house          C   4.62,-74.129    195.0   97919.38   502.150667
4         house          C    4.62,123.23      NaN   97919.38          NaN

### Dropping Columns

Just like we can add columns, we can also take them away. To do this, we’ll use the drop method. If I wanted to drop the “department” column from colombia-real-estate-1, the code would look like this:

In [53]:
df2 = df.drop("department", axis="columns")
df2.head()

  property_type        lat-lon  area_m2  price_usd     price_m2
0         house   4.69,-74.048    187.0  330899.98  1769.518610
1         house  4.695,-74.082     82.0  121555.09  1482.379146
2         house  4.535,-75.676    235.0  219474.47   933.933915
3         house   4.62,-74.129    195.0   97919.38   502.150667
4         house    4.62,123.23      NaN   97919.38          NaN

In [54]:
df2 = df.drop(2, axis="index")
df2.head()

  property_type department        lat-lon  area_m2  price_usd     price_m2
0         house          A   4.69,-74.048    187.0  330899.98  1769.518610
1         house          C  4.695,-74.082     82.0  121555.09  1482.379146
3         house          C   4.62,-74.129    195.0   97919.38   502.150667
4         house          C    4.62,123.23      NaN   97919.38          NaN

### Dropping Rows

Including rows with empty cells can radically skew the results of our analysis, so we often drop them from the dataset. We can do this with the dropna method. If we wanted to do this with df, the code would look like this:

In [55]:
print("df shape before dropping rows", df.shape)
df.dropna(inplace=True)
print("df shape after dropping rows", df.shape)
df.head()

df shape before dropping rows (5, 6)
df shape after dropping rows (4, 6)

  property_type department        lat-lon  area_m2  price_usd     price_m2
0         house          A   4.69,-74.048    187.0  330899.98  1769.518610
1         house          C  4.695,-74.082     82.0  121555.09  1482.379146
2         house          A  4.535,-75.676    235.0  219474.47   933.933915
3         house          C   4.62,-74.129    195.0   97919.38   502.150667

### Splitting Strings

It might be useful to split strings into their constituent parts, and create new columns to contain them. To do this, we’ll use the .str.split method, and include the character we want to use as the place where the data splits apart. In the `mexico-city-real-estate-1df3[["lat", "lon"]] = df3["lat-lon"].str.split(",", expand=True)
df3` dataset, we might be interested breaking the `"lat-lon"` column into a `"lat"` column and a `"lon"` column. We’ll split it at `“,”` with code that looks like this:

In [56]:
df[["lat", "lon"]] = df["lat-lon"].str.split(",", expand=True)
df

,property_type,department,lat-lon,area_m2,price_usd,price_m2,lat,lon
0,house,A,"4.69,-74.048",187.0,330899.98,1769.518610,4.69,-74.048
1,house,C,"4.695,-74.082",82.0,121555.09,1482.379146,4.695,-74.082
2,house,A,"4.535,-75.676",235.0,219474.47,933.933915,4.535,-75.676
3,house,C,"4.62,-74.129",195.0,97919.38,502.150667,4.62,-74.129

### Recasting Data

Depending on who formatted your dataset, the types of data assigned to each column might need to be changed. If, for example, a column containing only numbers had been mistaken for a column containing only strings, we’d need to change that through a process called recasting. Using the colombia-real-estate-1 dataset, we could recast the entire dataset as strings by using the astype method, like this:

In [57]:
print(df.info())
newdf = df.astype("str")
print(newdf.info())

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  4 non-null      object
 1   department     4 non-null      object
 2   lat-lon        4 non-null      object
 3   area_m2        4 non-null      float64
 4   price_usd      4 non-null      float64
 5   price_m2       4 non-null      float64
 6   lat            4 non-null      object
 7   lon            4 non-null      object
dtypes: float64(3), object(5)
memory usage: 288.0+ bytes
None
<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  4 non-null      object
 1   department     4 non-null      object
 2   lat-lon        4 non-null      object
 3   area_m2        4 non-null      object
 4   price_usd      4 non-null      object
 5   price_m2       4 non-null      object
 6   lat            4 non-null      object
 7   lon            4 non-null      object
dtypes: object(8)
memory usage: 288.0+ bytes
None

This is a useful approach, but, more often than not, you’ll want to only recast individual columns. In the colombia-real-estate-1 dataset, the "area_m2" column is cast as float64. Let's change it to int. We’ll still use the astype method, but we'll insert the name of the column. The code looks like this:

In [58]:
df["area_m2"] = df.area_m2.astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  4 non-null      object
 1   department     4 non-null      object
 2   lat-lon        4 non-null      object
 3   area_m2        4 non-null      int64
 4   price_usd      4 non-null      float64
 5   price_m2       4 non-null      float64
 6   lat            4 non-null      object
 7   lon            4 non-null      object
dtypes: float64(2), int64(1), object(5)
memory usage: 288.0+ bytes

### Replacing String Characters

Another change you might want to make is replacing the characters in a string. To do this, we’ll use the replace method again, being sure to specify which string should be replaced, and what new string should replace it. For example, if we wanted to replace the string “house” with the string “single_family” in the colombia-real-estate-1 dataset, the code would look like this:

In [59]:
df["property_type"] = df["property_type"].str.replace("house", "single_family")
df.head()

,property_type,department,lat-lon,area_m2,price_usd,price_m2,lat,lon
0,single_family,A,"4.69,-74.048",187,330899.98,1769.518610,4.69,-74.048
1,single_family,C,"4.695,-74.082",82,121555.09,1482.379146,4.695,-74.082
2,single_family,A,"4.535,-75.676",235,219474.47,933.933915,4.535,-75.676
3,single_family,C,"4.62,-74.129",195,97919.38,502.150667,4.62,-74.129

In [60]:
df["property_type"] = df["property_type"].str.replace("apartment", "multi_family")
df

,property_type,department,lat-lon,area_m2,price_usd,price_m2,lat,lon
0,single_family,A,"4.69,-74.048",187,330899.98,1769.518610,4.69,-74.048
1,single_family,C,"4.695,-74.082",82,121555.09,1482.379146,4.695,-74.082
2,single_family,A,"4.535,-75.676",235,219474.47,933.933915,4.535,-75.676
3,single_family,C,"4.62,-74.129",195,97919.38,502.150667,4.62,-74.129

In [67]:
replace_value = {187: 0, 235: 1}

df["area_m2"].replace(replace_value)
df

,property_type,department,lat-lon,area_m2,price_usd,price_m2,lat,lon
0,single_family,A,"4.69,-74.048",0,330899.98,1769.518610,4.69,-74.048
1,single_family,C,"4.695,-74.082",82,121555.09,1482.379146,4.695,-74.082
2,single_family,A,"4.535,-75.676",1,219474.47,933.933915,4.535,-75.676
3,single_family,C,"4.62,-74.129",195,97919.38,502.150667,4.62,-74.129

In [68]:
df1 = pd.read_csv("data/mexico-city-real-estate-1.csv")
df2 = pd.read_csv("data/mexico-city-real-estate-2.csv")
print("df1 shape:", df1.shape)
print("df2 shape:", df2.shape)

df1 shape: (5, 5)
df2 shape: (5, 5)

In [69]:
concat_df = pd.concat([df1, df2])
print("concat_df shape:", concat_df.shape)
concat_df.head()

concat_df shape: (10, 5)

  property_type department        lat-lon  area_m2  price_usd
0         house          A   4.69,-74.048    187.0  330899.98
1         house          C  4.695,-74.082     82.0  121555.09
2         house          A  4.535,-75.676    235.0  219474.47
3         house          C   4.62,-74.129    195.0   97919.38
4         house          C    4.62,123.23      NaN   97919.38

### Saving a DataFrame as a CSV

Once you’ve cleaned all your data and gotten the DataFrame to show everything you want it to show, it’s time to save the DataFrame as a new CSV file using the to_csv method. First, let's load up the `mexico-city-real-estate-1` dataset, and use head to see the first five rows of data:

In [70]:
concat_df

  property_type department        lat-lon  area_m2  price_usd
0         house          A   4.69,-74.048    187.0  330899.98
1         house          C  4.695,-74.082     82.0  121555.09
2         house          A  4.535,-75.676    235.0  219474.47
3         house          C   4.62,-74.129    195.0   97919.38
4         house          C    4.62,123.23      NaN   97919.38
0         house          A   4.69,-74.048    187.0  330899.98
1         house          C  4.695,-74.082     82.0  121555.09
2         house          A  4.535,-75.676    235.0  219474.47
3         house          C   4.62,-74.129    195.0   97919.38
4         house          C    4.62,123.23      NaN   97919.38

In [71]:
concat_df.to_csv("data/concat_2Series.csv", index = False)